## Data_Engineering_Porject_02

 1- Find Dataset fom link (this part will be in Porject Part_1)
 2- Build Data Model (this part will be in Porject Part_1)
 3- Write Python code to create table structure (this part will be in Porject Part_1)
 4- Insert Data from file to database (this part will be in Porject Part_2)
 5- Build Web application to visualize the data using Python (this part will be in Porject Part_3)
 6- Connect Database to Tableau for also data visualistion (this part will be in Porject Part_4)

## Import the PostgreSLQ Python plugin

In [1]:
!pip install psycopg2

!pip install psycopg2-binary

Requirement already satisfied: psycopg2 in c:\users\admin\anaconda3\lib\site-packages (2.9.3)
Requirement already satisfied: psycopg2-binary in c:\users\admin\anaconda3\lib\site-packages (2.9.3)

# Import the library

In [1]:
import psycopg2
import pandas as pd

# Close my first connexion and connect to my new db

In [2]:
# connect to my new db 
def create_database():
    
    conn = psycopg2.connect("host=localhost dbname=postgres user=postgres password=admin")
    conn.set_session(autocommit=True)
    cur = conn.cursor()
    
    # create sparkify database with UTF8 encoding
    
    cur.execute("DROP DATABASE customerdb")
    cur.execute("CREATE DATABASE customerdb")
    #close
    conn.close()
   
    # connect to sparkify db
    conn = psycopg2.connect("host=localhost dbname=customerdb user=postgres password=admin")
    cur = conn.cursor()
    
    
    return cur, conn

In [3]:
try:
    conn = psycopg2.connect(host="localhost",database="postgres", user="postgres", password="admin")
except pyscopg2.Error as e:
    print('Error: Could not make connection to the Postgres database')
    print(e)
try:
    cursor = conn.cursor()
except psycopg2.Error as e:
    print("Error could not get the Database")
    print(e)
conn.set_session(autocommit=True)

try:
    cursor.execute("DROP DATABASE customerdb")
    cursor.execute("CREATE DATABASE customerdb")
except psycopg2.Error as e:
    print("Error could not create the Database")
    print(e)
    # Close connetion to default db
    conn.close()

## Drop table function

In [4]:
def drop_table(cur,conn):
    for query in drop_table_queries:
        cur.execute(query)
        conn.commit()

# Create table function

In [5]:
def create_table(cur, conn):
    for query in create_table_queries:
        cur.execute(query)
        conn.commit()

# Load Data

In [6]:
## Dataset link: https://www.kaggle.com/datasets

In [7]:
## CustomerBase
customerbase =pd.read_excel("C://Users/Admin\Documents/PostgreSQLDB/DataEngineeringProject02/customerdatasets/CustomerBase.xlsx")

In [8]:
## TransactionBase
transactionbase =pd.read_excel("C://Users/Admin\Documents/PostgreSQLDB/DataEngineeringProject02/customerdatasets/TransactionBase.xlsx")

In [9]:

## FraudBase
fraudbase =pd.read_excel("C://Users/Admin\Documents/PostgreSQLDB/DataEngineeringProject02/customerdatasets/FraudBase.xlsx")

In [10]:

## CardBase
cardbase =pd.read_excel("C://Users/Admin\Documents/PostgreSQLDB/DataEngineeringProject02/customerdatasets/CardBase.xlsx")

In [11]:

## CreditcardBase
creditcardbase =pd.read_excel("C://Users/Admin\Documents/PostgreSQLDB/DataEngineeringProject02/customerdatasets/CreditCardData.xlsx")

In [12]:
cur, conn = create_database()

In [13]:
transactionbase_table = ("""CREATE TABLE IF NOT EXISTS transactionbase(
transaction_id VARCHAR PRIMARY KEY NOT NULL,
transaction_date  Date,
credit_card_id VARCHAR,
transaction_value INT,
transaction_segment VARCHAR
)""")

In [14]:
transactionbase.head()

,Transaction_ID,Transaction_Date,Credit_Card_ID,Transaction_Value,Transaction_Segment
0,CTID28830551,2016-04-24,1629-9566-3285-2123,23649,SEG25
1,CTID45504917,2016-02-11,3697-6001-4909-5350,26726,SEG16
2,CTID47312290,2016-11-01,5864-4475-3659-1440,22012,SEG14
3,CTID25637718,2016-01-28,5991-4421-8476-3804,37637,SEG17
4,CTID66743960,2016-03-17,1893-8853-9900-8478,5113,SEG14

In [15]:
cur.execute(transactionbase_table)
conn.commit()

In [16]:
customerbase_table = ("""CREATE TABLE IF NOT EXISTS customerbase(
cust_id VARCHAR PRIMARY KEY NOT NULL,
age  INT,
customer_segment VARCHAR,
customer_vintage_group VARCHAR
)""")

In [17]:
customerbase.head()

   Cust_ID  Age Customer_Segment Customer_Vintage_Group
0  CC25034   35          Diamond                    VG1
1  CC59625   22          Diamond                    VG1
2  CC69314   33          Diamond                    VG1
3  CC67036   46          Diamond                    VG1
4  CC25597   44          Diamond                    VG1

In [18]:
cur.execute(customerbase_table)
conn.commit()

In [19]:
fraudbase_table = ("""CREATE TABLE IF NOT EXISTS fraudbase(
transaction_id VARCHAR PRIMARY KEY NOT NULL,
fraud_flag INT
)""")

In [20]:
fraudbase.head()

  Transaction_ID  Fraud_Flag
0   CTID50558449           1
1   CTID55936882           1
2   CTID63762180           1
3   CTID76723439           1
4   CTID21246201           1

In [21]:
cur.execute(fraudbase_table)
conn.commit()

In [22]:
cardbase_table = ("""CREATE TABLE IF NOT EXISTS cardbase(
card_number VARCHAR PRIMARY KEY NOT NULL,
card_family  VARCHAR,
credit_limit INT,
cust_id VARCHAR
)""")

In [23]:
cardbase.head()

           Card_Number Card_Family  Credit_Limit  Cust_ID
0  8638-5407-3631-8196     Premium        530000  CC67088
1  7106-4239-7093-1515        Gold         18000  CC12076
2  6492-5655-8241-3530     Premium        596000  CC97173
3  2868-5606-5152-5706        Gold         27000  CC55858
4  1438-6906-2509-8219    Platinum        142000  CC90518

In [24]:
cur.execute(cardbase_table)
conn.commit()

In [25]:
creditcardbase_table = ("""CREATE TABLE IF NOT EXISTS creditcardbase(
transaction_id VARCHAR PRIMARY KEY NOT NULL,
transaction_date  Date,
credit_card_id VARCHAR,
transaction_value INT,
Transaction_Segment VARCHAR

)""")

In [26]:
cur.execute(creditcardbase_table)
conn.commit()

# INSERT Data into departments table

In [27]:
transactionbase_table = ("""INSERT INTO  transactionbase(
transaction_id,
transaction_date,
credit_card_id  ,
transaction_value ,
transaction_segment)
VALUES (%s,%s,%s,%s,%s)
""")

In [28]:
for i, row in transactionbase.iterrows():
    cur.execute(transactionbase_table, list(row))

In [29]:
conn.commit()

In [ ]:
## Upload data from your datasource

In [ ]:
## CustomerBase
customerbase =pd.read_excel("C://Users/Admin\Documents/PostgreSQLDB/DataEngineeringProject02/customerdatasets/CustomerBase.xlsx")
http://localhost:8888/notebooks/Data_Engineering_Porject_02.ipynb

In [ ]:
# INSERT Data into Customer table

In [30]:
customerbase_table = (""" INSERT INTO customerbase(
cust_id,
age,
customer_segment,
customer_vintage_group)
VALUES(%s,%s,%s,%s)
""")

In [31]:

customerbase.head()

   Cust_ID  Age Customer_Segment Customer_Vintage_Group
0  CC25034   35          Diamond                    VG1
1  CC59625   22          Diamond                    VG1
2  CC69314   33          Diamond                    VG1
3  CC67036   46          Diamond                    VG1
4  CC25597   44          Diamond                    VG1

In [32]:
for i,row in customerbase.iterrows():
    cur.execute(customerbase_table, list(row))

In [33]:
conn.commit()

In [34]:
fraudbase_table = (""" INSERT INTO fraudbase(
transaction_id,
fraud_flag)
VALUES(%s,%s)
""")

In [35]:
for i,row in fraudbase.iterrows():
    cur.execute(fraudbase_table, list(row))

In [36]:
conn.commit()

In [37]:
cardbase_table = ("""INSERT INTO cardbase(
card_number,
card_family,
credit_limit,
cust_id)
VALUES(%s,%s,%s,%s)
""")

In [38]:
for i,row in cardbase.iterrows():
    cur.execute(cardbase_table, list(row))

In [39]:
conn.commit()

In [40]:
creditcardbase_table = (""" INSERT INTO creditcardbase(
transaction_id,
transaction_date,
credit_card_id ,
transaction_value ,
Transaction_Segment)
VALUES(%s,%s,%s,%s,%s)
""")

In [41]:

creditcardbase.head()

,Transaction_ID,Transaction_Date,Credit_Card_ID,Transaction_Value,Transaction_Segment
0,CTID28830551,2016-04-24,1629-9566-3285-2123,23649,SEG25
1,CTID45504917,2016-02-11,3697-6001-4909-5350,26726,SEG16
2,CTID47312290,2016-11-01,5864-4475-3659-1440,22012,SEG14
3,CTID25637718,2016-01-28,5991-4421-8476-3804,37637,SEG17
4,CTID66743960,2016-03-17,1893-8853-9900-8478,5113,SEG14

In [42]:
for i,row in creditcardbase.iterrows():
    cur.execute(creditcardbase_table, list(row))

In [43]:
conn.commit()

# INSERT Data into locations table

In [145]:
try:
    cur.execute("INSERT INTO  locations (location_id , location_name)\
    VALUES(%s,%s)",\
               (1,"swaziland"))
except psycopg2.Error as e:
    print("Error could not create the table")
    print(e)

try:
    cur.execute("INSERT INTO  locations (location_id, location_name)\
    VALUES(%s,%s)",\
               (2,"US"))
except psycopg2.Error as e:
    print("Error could not create the table")
    print(e)
try:
    cur.execute("INSERT INTO  locations (location_id , location_name  )\
    VALUES(%s,%s)",\
               (3,"Brezil"))
except psycopg2.Error as e:
    print("Error could not create the table")
    print(e)

try:
    cur.execute("INSERT INTO  locations (location_id , location_name  )\
    VALUES(%s,%s)",\
               (4,"Moroco"))
except psycopg2.Error as e:
    print("Error could not create the table")
    print(e)

# INSERT Data into employees table

In [147]:
try:
    cur.execute("INSERT INTO  employees (employee_id, employee_fname, employee_lname, department_id , location_id)\
    VALUES(%s,%s,%s,%s,%s)",\
               (1,"Thomas","Diene",3,3))
except psycopg2.Error as e:
    print("Error could not create the table")
    print(e)

    
try:
    cur.execute("INSERT INTO  employees (employee_id, employee_fname, employee_lname, department_id , location_id)\
    VALUES(%s,%s,%s,%s,%s)",\
               (2,"Reggie","Reed",1,2))
except psycopg2.Error as e:
    print("Error could not create the table")
    print(e)


try:
    cur.execute("INSERT INTO  employees (employee_id, employee_fname, employee_lname, department_id , location_id)\
    VALUES(%s,%s,%s,%s,%s)",\
               (3,"Patrick","Horrigan",1,2))
except psycopg2.Error as e:
    print("Error could not create the table")
    print(e)
    
try:
    cur.execute("INSERT INTO  employees (employee_id, employee_fname, employee_lname, department_id , location_id)\
    VALUES(%s,%s,%s,%s,%s)",\
               (4,"Jenna","Biden",2,1))
except psycopg2.Error as e:
    print("Error could not create the table")
    print(e)

    
try:
    cur.execute("INSERT INTO  employees (employee_id, employee_fname, employee_lname, department_id , location_id)\
    VALUES(%s,%s,%s,%s,%s)",\
               (5,"Micheal","Barack",2,2))
except psycopg2.Error as e:
    print("Error could not create the table")
    print(e)

# Select data from employees table

In [153]:

try:
    cur.execute("select * from employees;")
except psycopg2.Error as e:
    print("Error could not select the data")
    print(e)

row =cur.fetchone()
while row:
    print(row)
    row= cur.fetchone()

(1, 'Thomas', 'Diene', 3, 3)
(2, 'Reggie', 'Reed', 1, 2)
(3, 'Patrick', 'Horrigan', 1, 2)
(4, 'Jenna', 'Biden', 2, 1)
(5, 'Micheal', 'Barack', 2, 2)

# Close the connexion

In [154]:
cur.close()
conn.close()